# Data Science Part Time Course

## Lesson 1 - Lab-01: Introduction to MySQL

## 1. Accessing the MySQL database

Connect via the link: [http://paulgoodall.tech/mywebsql/]

Use the credentials:
* username: dat11syd
* password: dat11syd

## 2. List the available databases

Try the command:

```sql
show databases;
```

## 3. Showing the tables in a database

Try the command:

```sql
show tables in dat11syd_ex1;
```

## 4. Learning about a particular table:

Try the command:

```sql
describe dat11syd_ex1.people_list;
```

## 5. Display the first 5 rows from 'all columns' (*) in the table:

Try the command:

```sql
select * from dat11syd_ex1.people_list limit 5;
```

In [1]:
#  Can you edit the above to only show the first column?

## 6. Simple query - counting the number of rows in the dataset:

Try the command:

```sql
select count(*) as my_count from dat11syd_ex1.people_list;
```

In [ ]:
# Above we have called the answer "my_count" but you can call it whatever you like.

## 7. Aggregating table values:

Try the command:

```sql
select name1, count(*) as my_count
from dat11syd_ex1.people_list
group by name1
order by my_count desc;
```

In [ ]:
# The above is grouping by the first name - you should see that the first name isn't unique.

## 8. Joining the values from different tables based upon an ID in common:

Try the command:

```sql
select T1.*, T2.age
from dat11syd_ex1.people_list as T1
  left join dat11syd_ex1.people_ages as T2
  on T1.person_id = T2.person_id
```

In [2]:
# The above joins on the ages from table 2 onto the data from table 1 by looking it up by the ID column 'person_id'
#
# Q1 - Why are there NULL values in the dataset?
# Q2 - What happens if you try other join types:  right join, outer join, inner join
# Q3 - What happens if you left join by "name1" instead of "person_id"?

## 9. Creating a new table:

Try the command:

** EDIT THE NAME TO YOURS! **

```sql
create table dat11syd_ex1.people_joined_paul as
select T1.*, T2.age
from dat11syd_ex1.people_list as T1
  left join dat11syd_ex1.people_ages as T2
  on T1.person_id = T2.person_id;
```

In [ ]:
## Does the new table look as you expected?

## 10. Joining a large dataset:

a) - look at the tables in the **dat11syd_ex2** database

b) - use count(*) to check how many rows are in each table, and "limit 5" to look at the first 5 rows of each

c) - use what you've learned to create a new table called: **dat11syd_ex2.YOUR_NAME** that has all the possible columns associated with each property sale.  Ask **James** to review when done.